src/main/resources/creation-test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Box SDK Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Parameters" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="user.threads" elementType="Argument">
            <stringProp name="Argument.name">user.threads</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Number of concurrent clients</stringProp>
          </elementProp>
          <elementProp name="rampup" elementType="Argument">
            <stringProp name="Argument.name">rampup</stringProp>
            <stringProp name="Argument.value">4</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Ramp-up time for test</stringProp>
          </elementProp>
          <elementProp name="user.login" elementType="Argument">
            <stringProp name="Argument.name">user.login</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Admin user email</stringProp>
          </elementProp>
          <elementProp name="client.id" elementType="Argument">
            <stringProp name="Argument.name">client.id</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Box App Client Id</stringProp>
          </elementProp>
          <elementProp name="client.secret" elementType="Argument">
            <stringProp name="Argument.name">client.secret</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Box App Client Secret</stringProp>
          </elementProp>
          <elementProp name="enterprise.id" elementType="Argument">
            <stringProp name="Argument.name">enterprise.id</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Box Enterprise Id</stringProp>
          </elementProp>
          <elementProp name="public.key.id" elementType="Argument">
            <stringProp name="Argument.name">public.key.id</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Box App Public Key Id</stringProp>
          </elementProp>
          <elementProp name="private.key.path" elementType="Argument">
            <stringProp name="Argument.name">private.key.path</stringProp>
            <stringProp name="Argument.value">/&lt;path_to_key&gt;/private_key.pem</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Path to Box App private key file</stringProp>
          </elementProp>
          <elementProp name="key.pass" elementType="Argument">
            <stringProp name="Argument.name">key.pass</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Box App Key Passphrase</stringProp>
          </elementProp>
          <elementProp name="max.cache.entries" elementType="Argument">
            <stringProp name="Argument.name">max.cache.entries</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Box App max cache entries</stringProp>
          </elementProp>
          <elementProp name="max.folder.count" elementType="Argument">
            <stringProp name="Argument.name">max.folder.count</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Maximum amount of folders to create</stringProp>
          </elementProp>
          <elementProp name="max.file.count" elementType="Argument">
            <stringProp name="Argument.name">max.file.count</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Maximum amount of files to create in each folder</stringProp>
          </elementProp>
          <elementProp name="sample.file.path" elementType="Argument">
            <stringProp name="Argument.name">sample.file.path</stringProp>
            <stringProp name="Argument.value">/&lt;path_to_proj_folder&gt;/box-jmeter-sampler/src/main/resources/test.pdf</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Path to the sample PDF file</stringProp>
          </elementProp>
          <elementProp name="metadata.template.key" elementType="Argument">
            <stringProp name="Argument.name">metadata.template.key</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Key of the Metadata Template. Note that this is not the Display Name.</stringProp>
          </elementProp>
          <elementProp name="metadata.keys" elementType="Argument">
            <stringProp name="Argument.name">metadata.keys</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Only Use Text or Dropdown MD Properties. Key of the Metadata properties. Note that this is not the Display Name.</stringProp>
          </elementProp>
          <elementProp name="metadata.values" elementType="Argument">
            <stringProp name="Argument.name">metadata.values</stringProp>
            <stringProp name="Argument.value">This is a test,One</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Only Use Text or Dropdown MD Properties. Value of the Metadata properties. Note that this is not the Display Name.</stringProp>
          </elementProp>
          <elementProp name="use.current.datetime" elementType="Argument">
            <stringProp name="Argument.name">use.current.datetime</stringProp>
            <stringProp name="Argument.value">true</stringProp>
            <stringProp name="Argument.desc">Set to true to automatically populate with current date.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Main Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptestnow</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${user.threads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampup}</stringProp>
        <longProp name="ThreadGroup.start_time">1293887799000</longProp>
        <longProp name="ThreadGroup.end_time">1293887799000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
      </ThreadGroup>
      <hashTree>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Get Box Connection" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="client.id" elementType="Argument">
                <stringProp name="Argument.name">client.id</stringProp>
                <stringProp name="Argument.value">${client.id}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="client.secret" elementType="Argument">
                <stringProp name="Argument.name">client.secret</stringProp>
                <stringProp name="Argument.value">${client.secret}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="enterprise.id" elementType="Argument">
                <stringProp name="Argument.name">enterprise.id</stringProp>
                <stringProp name="Argument.value">${enterprise.id}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="public.key.id" elementType="Argument">
                <stringProp name="Argument.name">public.key.id</stringProp>
                <stringProp name="Argument.value">${public.key.id}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="private.key.path" elementType="Argument">
                <stringProp name="Argument.name">private.key.path</stringProp>
                <stringProp name="Argument.value">${private.key.path}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="key.pass" elementType="Argument">
                <stringProp name="Argument.name">key.pass</stringProp>
                <stringProp name="Argument.value">${key.pass}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="max.cache.entries" elementType="Argument">
                <stringProp name="Argument.name">max.cache.entries</stringProp>
                <stringProp name="Argument.value">${max.cache.entries}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.box.platform.jmeter.sampler.GetBoxConnection</stringProp>
        </JavaSampler>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Create Folder Loop" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">${max.folder.count}</stringProp>
        </LoopController>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Folder Counter" enabled="true">
            <stringProp name="CounterConfig.start">1</stringProp>
            <stringProp name="CounterConfig.end">${max.folder.count}</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">current.folder.count</stringProp>
            <stringProp name="CounterConfig.format">#</stringProp>
            <boolProp name="CounterConfig.per_user">false</boolProp>
          </CounterConfig>
          <hashTree/>
          <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Create Folders" enabled="true">
            <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="client.id" elementType="Argument">
                  <stringProp name="Argument.name">client.id</stringProp>
                  <stringProp name="Argument.value">${client.id}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="client.secret" elementType="Argument">
                  <stringProp name="Argument.name">client.secret</stringProp>
                  <stringProp name="Argument.value">${client.secret}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="enterprise.id" elementType="Argument">
                  <stringProp name="Argument.name">enterprise.id</stringProp>
                  <stringProp name="Argument.value">${enterprise.id}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="public.key.id" elementType="Argument">
                  <stringProp name="Argument.name">public.key.id</stringProp>
                  <stringProp name="Argument.value">${public.key.id}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="private.key.path" elementType="Argument">
                  <stringProp name="Argument.name">private.key.path</stringProp>
                  <stringProp name="Argument.value">${private.key.path}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="key.pass" elementType="Argument">
                  <stringProp name="Argument.name">key.pass</stringProp>
                  <stringProp name="Argument.value">${key.pass}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="max.cache.entries" elementType="Argument">
                  <stringProp name="Argument.name">max.cache.entries</stringProp>
                  <stringProp name="Argument.value">${max.cache.entries}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="user.login" elementType="Argument">
                  <stringProp name="Argument.name">user.login</stringProp>
                  <stringProp name="Argument.value">${user.login}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="current.folder.count" elementType="Argument">
                  <stringProp name="Argument.name">current.folder.count</stringProp>
                  <stringProp name="Argument.value">${current.folder.count}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="classname">com.box.platform.jmeter.sampler.CreateFolder</stringProp>
          </JavaSampler>
          <hashTree/>
          <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Upload File Loop" enabled="true">
            <boolProp name="LoopController.continue_forever">true</boolProp>
            <stringProp name="LoopController.loops">${max.file.count}</stringProp>
          </LoopController>
          <hashTree>
            <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="File Counter" enabled="true">
              <stringProp name="CounterConfig.start">1</stringProp>
              <stringProp name="CounterConfig.end">${max.file.count}</stringProp>
              <stringProp name="CounterConfig.incr">1</stringProp>
              <stringProp name="CounterConfig.name">current.file.count</stringProp>
              <stringProp name="CounterConfig.format">#</stringProp>
              <boolProp name="CounterConfig.per_user">false</boolProp>
            </CounterConfig>
            <hashTree/>
            <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Upload Files" enabled="true">
              <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="client.id" elementType="Argument">
                    <stringProp name="Argument.name">client.id</stringProp>
                    <stringProp name="Argument.value">${client.id}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="client.secret" elementType="Argument">
                    <stringProp name="Argument.name">client.secret</stringProp>
                    <stringProp name="Argument.value">${client.secret}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="enterprise.id" elementType="Argument">
                    <stringProp name="Argument.name">enterprise.id</stringProp>
                    <stringProp name="Argument.value">${enterprise.id}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="public.key.id" elementType="Argument">
                    <stringProp name="Argument.name">public.key.id</stringProp>
                    <stringProp name="Argument.value">${public.key.id}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="private.key.path" elementType="Argument">
                    <stringProp name="Argument.name">private.key.path</stringProp>
                    <stringProp name="Argument.value">${private.key.path}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="key.pass" elementType="Argument">
                    <stringProp name="Argument.name">key.pass</stringProp>
                    <stringProp name="Argument.value">${key.pass}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="max.cache.entries" elementType="Argument">
                    <stringProp name="Argument.name">max.cache.entries</stringProp>
                    <stringProp name="Argument.value">${max.cache.entries}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="user.login" elementType="Argument">
                    <stringProp name="Argument.name">user.login</stringProp>
                    <stringProp name="Argument.value">${user.login}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="current.file.count" elementType="Argument">
                    <stringProp name="Argument.name">current.file.count</stringProp>
                    <stringProp name="Argument.value">${current.file.count}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="sample.file.path" elementType="Argument">
                    <stringProp name="Argument.name">sample.file.path</stringProp>
                    <stringProp name="Argument.value">${sample.file.path}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="classname">com.box.platform.jmeter.sampler.UploadFile</stringProp>
            </JavaSampler>
            <hashTree/>
            <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Add Metadata" enabled="true">
              <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="client.id" elementType="Argument">
                    <stringProp name="Argument.name">client.id</stringProp>
                    <stringProp name="Argument.value">${client.id}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="client.secret" elementType="Argument">
                    <stringProp name="Argument.name">client.secret</stringProp>
                    <stringProp name="Argument.value">${client.secret}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="enterprise.id" elementType="Argument">
                    <stringProp name="Argument.name">enterprise.id</stringProp>
                    <stringProp name="Argument.value">${enterprise.id}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="public.key.id" elementType="Argument">
                    <stringProp name="Argument.name">public.key.id</stringProp>
                    <stringProp name="Argument.value">${public.key.id}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="private.key.path" elementType="Argument">
                    <stringProp name="Argument.name">private.key.path</stringProp>
                    <stringProp name="Argument.value">${private.key.path}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="key.pass" elementType="Argument">
                    <stringProp name="Argument.name">key.pass</stringProp>
                    <stringProp name="Argument.value">${key.pass}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="max.cache.entries" elementType="Argument">
                    <stringProp name="Argument.name">max.cache.entries</stringProp>
                    <stringProp name="Argument.value">${max.cache.entries}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="user.login" elementType="Argument">
                    <stringProp name="Argument.name">user.login</stringProp>
                    <stringProp name="Argument.value">${user.login}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="current.file.count" elementType="Argument">
                    <stringProp name="Argument.name">current.file.count</stringProp>
                    <stringProp name="Argument.value">${current.file.count}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="metadata.template.key" elementType="Argument">
                    <stringProp name="Argument.name">metadata.template.key</stringProp>
                    <stringProp name="Argument.value">${metadata.template.key}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="metadata.keys" elementType="Argument">
                    <stringProp name="Argument.name">metadata.keys</stringProp>
                    <stringProp name="Argument.value">${metadata.keys}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="metadata.values" elementType="Argument">
                    <stringProp name="Argument.name">metadata.values</stringProp>
                    <stringProp name="Argument.value">${metadata.values}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                  <elementProp name="use.current.datetime" elementType="Argument">
                    <stringProp name="Argument.name">use.current.datetime</stringProp>
                    <stringProp name="Argument.value">${use.current.datetime}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="classname">com.box.platform.jmeter.sampler.CreateMetadataOnFile</stringProp>
            </JavaSampler>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>